
"event read status update" = "update leesstatus activiteit";

"device event status updated. The save" = "status activiteit apparaat bijgewerkt. Het opslaan";

"Resolved" = "Opgelost";
"Unresolved" = "Onopgelost";


"The message status could not be updated" = "De berichtstatus kan niet worden bijgewerkt";

// K9 : event status update error message
"Your HP device has sent a status update. This update could not be saved in HP Utility - Message Center" = "Het HP apparaat heeft een statusupdate verstuurd. Deze update kan niet worden opgeslagen in HP Utility - Berichtencentrum";

"Messages could not be displayed in HP Utility - Message Center" = "Berichten kunnen niet worden weergegeven in HP Utility - Berichtencentrum";